# -*- coding: utf-8 -*-

# ------------------------------
# @Time    : 2020/4/20
# @Author  : gao
# @File    : industry_class.py
# @Project : AmazingQuant
# ------------------------------

sw_industry_one = {'801020.SI': '采掘', '801030.SI': '化工', '801040.SI': '钢铁', '801050.SI': '有色金属',
                   '801710.SI': '建筑材料', '801720.SI': '建筑装饰', '801730.SI': '电气设备', '801890.SI': '机械设备',
                   '801740.SI': '国防军工', '801880.SI': '汽车', '801110.SI': '家用电器', '801130.SI': '纺织服装',
                   '801140.SI': '轻工制造', '801200.SI': '商业贸易', '801010.SI': '农林牧渔', '801120.SI': '食品饮料',
                   '801210.SI': '休闲服务', '801150.SI': '医药生物', '801160.SI': '公用事业', '801170.SI': '交通运输',
                   '801180.SI': '房地产', '801080.SI': '电子', '801750.SI': '计算机', '801760.SI': '传媒',
                   '801770.SI': '通信', '801780.SI': '银行', '801790.SI': '非银金融', '801230.SI': '综合'}
